tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'homebrew/php'
tap 'homebrew/versions'

brew 'clang-format
brew 'gcc'
brew 'gdb'
brew 'git'
brew 'go'
brew 'ipfs'
brew 'lua'
brew 'mas'
brew 'mongodb'
brew 'mysql'
brew 'nginx'
brew 'openssl'
brew 'postgresql'
brew 'python'
brew 'solidity'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'swagger-codegen'
brew 'travis'
brew 'web3j'
brew 'wget'

cask 'adobe-acrobat-reader'
cask 'alfred'
cask 'brave-browser'
cask 'daisydisk'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'ganache'
cask 'hammerspoon'
cask 'iterm2'
cask 'keepassx'
cask 'little-snitch'
cask 'love'
cask 'mac2imgur'
cask 'mongodb-compass'
cask 'mysqlworkbench'
cask 'paintbrush'
cask 'postman'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'transmission'
cask 'unity'
cask 'visual-studio-code'
cask 'vlc'
cask 'vmware-fusion'
cask 'webstorm'